app/views/teams/_form.html.erb

SELECT "sports".* FROM "sports"
---
    <%= f.label :sport %>
    <%= f.collection_select(:sport_id, Sport.all, :id, :name, :prompt => 'Select') %>