app/views/games/_form.html.erb

SELECT "teams".* FROM "teams"
---

	    <%= f.collection_select :home_team_id, Team.all, :id, :name, {:include_blank => true}, {class: "form-control"} %>