app/views/games/index.html.erb

<% @games.each do |game| %>
	<% @home_team = Team.find(game.home_team_id)  %>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]