app/controllers/games_controller.rb

SELECT "games".* FROM "games"  ORDER BY created_at ASC
---
	def index
		@games = Game.all.order('created_at ASC')

INSERT INTO "games" ("location", "schedule", "home_team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["location", "sa"], ["schedule", "2011-05-19 10:30:14.000000"], ["home_team_id", 1], ["created_at", "2016-08-25 22:46:45.374624"], ["updated_at", "2016-08-25 22:46:45.374624"]]
---
	def create
		p post_params
		@game = Game.new(post_params)

		if @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "sports".* FROM "sports" WHERE "sports"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@game = Game.find(params[:id])
		@home_team = Team.find(@game.home_team_id)
		@sport = Sport.find(@home_team.sport_id)

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]
---
	def destroy
		@game = Game.find(params[:id])
		@game.destroy