app/controllers/sports_controller.rb

	def create
		@sport = Sport.new(post_params)

		if @sport.save
---
INSERT INTO "sports" ("name", "max_players", "min_players", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Volleyball"], ["max_players", 6], ["min_players", 10], ["created_at", "2016-08-25 19:29:17.514481"], ["updated_at", "2016-08-25 19:29:17.514481"]]

	def show
		@sport = Sport.find(params[:id])
---
SELECT  "sports".* FROM "sports" WHERE "sports"."id" = $1 LIMIT 1  [["id", 1]]