app/controllers/teams_controller.rb

  def create
    @team = Team.new(post_params)

    if @team.save
---
INSERT INTO "teams" ("name", "sport_id", "mascot_name", "mascot_url", "captain_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"